Функция RPN(Выражение)
    Лексемы = СтрРазделить(Выражение, " ");
    Стек = Новый Массив;
    
    Для Каждого Лексема Из Лексемы Цикл
        Если Лексема = "+" Тогда
            Число2 = Стек.Удалить(Стек.Количество() - 1);
            Число1 = Стек.Удалить(Стек.Количество() - 1);
            Стек.Добавить(Число1 + Число2);
        ИначеЕсли Лексема = "*" Тогда
            Число2 = Стек.Удалить(Стек.Количество() - 1);
            Число1 = Стек.Удалить(Стек.Количество() - 1);
            Стек.Добавить(Число1 * Число2);
        Иначе
            Стек.Добавить(ЧислоВнутр(Лексема));
        КонецЕсли;
    КонецЦикла;
    
    Возврат Стек.Получить(0);
КонецФункции

Процедура ПриНачалеРаботыСистемы()
	Сообщить(RPN("(2 + 3) * 4;"));	
КонецПроцедуры