Функция Содержит01(Строка)
    Состояние = "A";
	
	Для Индекс = 1 По СтрДлина(Строка) Цикл
        Символ = Сред(Строка, Индекс, 1);
		
		Если Состояние = "A" Тогда
			Если Символ = "0" Тогда 
				Состояние = "B";
			ИначеЕсли Символ = "1" Тогда
				Состояние = "A";	
			КонецЕсли;
        ИначеЕсли Состояние = "B" Тогда
			Если Символ = "0" Тогда 
				Состояние = "B"; 
			ИначеЕсли Символ = "1" Тогда
				Состояние = "C";
			КонецЕсли;
        КонецЕсли;
				
	КонецЦикла; 
	
    Возврат Состояние = "C";
КонецФункции

Процедура ПриНачалеРаботыСистемы()   
	Сообщить("Последовательность 010 содержит 01: " + Содержит01("010"));
	Сообщить("Последовательность 010 содержит 100: " + Содержит01("100"));
	Сообщить("Последовательность 010 содержит 0011: " + Содержит01("0011"));
КонецПроцедуры;

